scripts/mutations/579-stock-map-memo-seeded-late.patch
diff --git a/lisp/fork.go b/lisp/fork.go
index 4da73dd..861a205 100644
--- a/lisp/fork.go
+++ b/lisp/fork.go
@@ -668,8 +668,10 @@ func (f *forker) mapData(md *MapData) *MapData {
 		// Memo before descending, as the generic path does (issue #576):
 		// an entry may reach back to md.
 		cp := NewMapData(nm)
-		f.maps[md] = cp
+		// mutation: #579 seed the memo AFTER descending, so a map reached
+		// through a second header (or itself) does not close onto this copy.
 		sm.copyInto(nm, f.val)
+		f.maps[md] = cp
 		return cp
 	}
 	if r, ok := md.mapBacking.(StringKeyRanger); ok {
