scripts/mutations/600-fork-keeps-macroexpansion.patch
diff --git a/lisp/fork.go b/lisp/fork.go
index e509d5c..c046eb9 100644
--- a/lisp/fork.go
+++ b/lisp/fork.go
@@ -470,9 +470,6 @@ func (f *forker) val(v *LVal) *LVal {
 	*cp = *v
 	// Memo before descending: v's children may reach back to v.
 	f.vals[v] = cp
-	// Macro-expansion debug metadata does not travel; it is only populated
-	// under an attached debugger and its contexts alias template values.
-	cp.macroExpansion = nil
 	if v.IsCellView() {
 		// v's Cells is a VIEW of another header's (the convention on
 		// cellsView): the template holds both over one backing array, so
